[
  {
    "text": {
      "ru": "Моя мама готовила в 3 часа",
      "en": "My mother was cooking at 3 o'clock"
    }
  },
  {
    "text": {
      "ru": "Я не работал вечером",
      "en": "I was not working in the evening"
    }
  },
  {
    "text": {
      "ru": "Он работал над английским языком в то время",
      "en": "He was working at his English at that time"
    }
  },
  {
    "text": {
      "ru": "Керри сидела у окна, когда он вошел",
      "en": "Сarrie was sitting by the window when he came in"
    }
  },
  {
    "text": {
      "ru": "Весной 1881 года он гостил у своего старого школьного товарища",
      "en": "In the spring of the year 1881 he was visiting his old schoolfellow"
    }
  },
  {
    "text": {
      "ru": "Она сказала, что придет к вам после ужина",
      "en": "She said she was coming to see you after supper"
    }
  },
  {
    "text": {
      "ru": "Он собирался стать инженером",
      "en": "He was going to be an engineer"
    }
  },
  {
    "text": {
      "ru": "Что они собирались делать?",
      "en": "What were they going to do?"
    }
  },
  {
    "text": {
      "ru": "Что ты делал вчера в 4 часа? Я обедал с другом",
      "en": "What were you doing at 4 o'clock yesterday? I was having dinner with a friend"
    }
  },
  {
    "text": {
      "ru": "Она просидела вчера в библиотеке с 2 до 6",
      "en": "She was sitting in the library from 2 till 6 yesterday"
    }
  },
  {
    "text": {
      "ru": "Тем летом моя мама работала уборщицей",
      "en": "My mother was working as a cleaner that summer"
    }
  },
  {
    "text": {
      "ru": "Я выглянул в окно. Светило солнце и пели птицы",
      "en": "I looked out of the window. The sun was shining and the birds were singing"
    }
  },
  {
    "text": {
      "ru": "Когда папа красил потолок, он пролил немного краски на пол",
      "en": "When my dad was painting the ceiling he split some paint on the floor"
    }
  },
  {
    "text": {
      "ru": "Джон приехал, когда я готовила ужин",
      "en": "John arrived when I was cooking supper"
    }
  },
  {
    "text": {
      "ru": "Пока Аня сидела и ничего не делала, я разрабатывал план, как нам добраться домой",
      "en": "While Ann was sitting doing nothing, I was working out a plan to get us home"
    }
  },
  {
    "text": {
      "ru": "Когда директор вошел в класс, мы писали диктант",
      "en": "When the headmaster came, we were writing a dictation"
    }
  },
  {
    "text": {
      "ru": "В то время он говорил слишком много",
      "en": "At that time he was always speaking too much"
    }
  },
  {
    "text": {
      "ru": "Мы слишком часто вчера что-то теряли",
      "en": "We were too often losing something yesterday"
    }
  },
  {
    "text": {
      "ru": "На прошлой неделе моя мама все время жаловалась на головную боль",
      "en": "My mother was complaining of headache all the time last week"
    }
  },
  {
    "text": {
      "ru": "Я хотел поинтересоваться, не желаете ли вы сходить со мной куда-нибудь вечером",
      "en": "I was wondering if you'd like to come out with me in the evening"
    }
  },
  {
    "text": {
      "ru": "Я очень надеялся, что он вскоре вернется",
      "en": "I was hoping he would come back soon"
    }
  }
]
