[
  {
    "text": {
      "ru": "Она позвонила мне к трем часам",
      "en": "She had called me by three o'clock"
    }
  },
  {
    "text": {
      "ru": "Я был в офисе уже к семи утра",
      "en": "I had been in the office by 7 am already"
    }
  },
  {
    "text": {
      "ru": "Я уже закончила свою работу к его приходу",
      "en": "I had already finished my work by the time he came"
    }
  },
  {
    "text": {
      "ru": "Он хотел, чтобы я присоединилась к теннисному клубу. Но я уже присоединилась к футбольному клубу",
      "en": "He wanted me to join the tennis club. But I had already joined the football club"
    }
  },
  {
    "text": {
      "ru": "Я хотела пойти в школу с ним. Но он уже ушел",
      "en": "I wanted to go to school with him. But he had already gone"
    }
  },
  {
    "text": {
      "ru": "Мои родители вернулись с работы к моему приходу из школы",
      "en": "My parents had returned from their work by the time I came from the school"
    }
  },
  {
    "text": {
      "ru": "Моя бабушка сделала очень вкусный обед к нашему приезду",
      "en": "My grandmother had made a very delicious meal by the time we arrived"
    }
  },
  {
    "text": {
      "ru": "Ты пришел к её работе к восьми часам?",
      "en": "Had you come to her by eight o'clock?"
    }
  },
  {
    "text": {
      "ru": "Вы закончили рисунок к приходу вашего учителя?",
      "en": "Had you finished your drawing by the time your teacher came?"
    }
  },
  {
    "text": {
      "ru": "Ты видел его до начала вечеринки?",
      "en": "Had you seen him before the show started?"
    }
  },
  {
    "text": {
      "ru": "Она пришла к шести часам?",
      "en": "Had she come by six o'clock?"
    }
  },
  {
    "text": {
      "ru": "Вы пришли к началу вечеринки?",
      "en": "Had you come by the time the party started?"
    }
  },
  {
    "text": {
      "ru": "Куда ты ушел до того, как вечеринка закончилась?",
      "en": "Where had you gone before the party finished?"
    }
  },
  {
    "text": {
      "ru": "Как ты нашел это к восьми часам?",
      "en": "How had you found that by eight o'clock?"
    }
  },
  {
    "text": {
      "ru": "Кого ты там встретил к тому времени, как позвонил мне?",
      "en": "Who had you met by the time you called me?"
    }
  },
  {
    "text": {
      "ru": "Когда он спросил, где книга, я сказал, что я даже не брал её",
      "en": "When he asked me where the book was, I said that I hadn't even taken it"
    }
  },
  {
    "text": {
      "ru": "К нашему приходу, он ещё не ушел, хотя мы опоздали",
      "en": "By the time we came, he hadn't gone away although we were late"
    }
  },
  {
    "text": {
      "ru": "Я не видел его уже три дня",
      "en": "I hadn't seen him for three days already"
    }
  },
  {
    "text": {
      "ru": "Он сказал, что  не обещал позвонить тебе, когда я говорила с ним вчера",
      "en": "He said, he hadn't promised to call you when I talked with him yesterday"
    }
  },
  {
    "text": {
      "ru": "Оказалось, что у него не было никакого плана",
      "en": "It turned that he hadn't had any plan"
    }
  },
  {
    "text": {
      "ru": "Я ещё не присоединилась к его клубу",
      "en": "I hadn't joined his club yet"
    }
  },
  {
    "text": {
      "ru": "Когда мы приехали, то обнаружили, что менеджер забронировал не ту комнату для нас",
      "en": "When we arrived we realized that the manager had reserved the wrong room for us"
    }
  },
  {
    "text": {
      "ru": "Анна была на работе, когда ты приехал? Нет, она уже ушла",
      "en": "Was Ann at work when you arrived? No, she had gone"
    }
  },
  {
    "text": {
      "ru": "Когда я вышел из дома моих друзей, то обнаружил, что забыл ключ",
      "en": "When I left my friend's house I realised that I had forgotten the keys"
    }
  },
  {
    "text": {
      "ru": "К тому времени мы купили все товары",
      "en": "We had bought the goods by that time"
    }
  },
  {
    "text": {
      "ru": "Это было лучшее время, что я провел здесь",
      "en": "That was the best time I had ever had here"
    }
  },
  {
    "text": {
      "ru": "Это была третья серьезная ошибка, которую ты допустил здесь",
      "en": "It was the third serious mistake you had made here"
    }
  },
  {
    "text": {
      "ru": "Мы ожидали, что ярмарку посетят больше людей",
      "en": "We had expected that more people attended the fair"
    }
  },
  {
    "text": {
      "ru": "Едва мы прибыли в отель, как начался дождь",
      "en": "We had hardly arrived at the hotel, when it started to rain"
    }
  }
]
