[
  {
    "text": {
      "ru": "Он подвел ее",
      "en": "He let her down"
    }
  },
  {
    "text": {
      "ru": "Она не катается сейчас на велосипеде",
      "en": "She isn't riding a bike now"
    }
  },
  {
    "text": {
      "ru": "Мы должны задобрить папу, прежде чем сообщать ему о поломанной машине",
      "en": "We'll have to butter Dad up before we tell him the news about the broken car"
    }
  },
  {
    "text": {
      "ru": "Ресторан должно быть восхитительный, так как всякий раз, когда я вижу меню, у меня текут слюнки",
      "en": "The restaurant is supposed to be wonderful and every time that I see the menu it makes my mouth water"
    }
  },
  {
    "text": {
      "ru": "Новый Айфон 5 расходится как горячие пирожки",
      "en": "The new iPhone 5 sells like hot cakes"
    }
  },
  {
    "text": {
      "ru": "Маленькая Джессика - папина любимица",
      "en": "Baby Jessica is the apple of her father's eye"
    }
  },
  {
    "text": {
      "ru": "Та подержанная машина, которую я купил, оказалась настоящей развалюхой. Она сломалась через неделю после покупки",
      "en": "That second-hand car I bought was a real lemon. It broke down after a week I bought it"
    }
  },
  {
    "text": {
      "ru": "Я боялся теста, но он оказался проще пареной репы",
      "en": "I was afraid of the test, but it was a piece of cake"
    }
  },
  {
    "text": {
      "ru": "Я зарабатываю на жизнь преподаванием",
      "en": "Teaching is my bread and butter"
    }
  },
  {
    "text": {
      "ru": "С тех пор, как я сломала ногу, мой муж вынужден зарабатывать на жизнь в одиночку",
      "en": "My husband has had to bring home the bacon alone ever since I broke my leg"
    }
  },
  {
    "text": {
      "ru": "Иногда я люблю смотреть глупые фильмы, потому что мне не надо думать",
      "en": "Sometimes I like watching cheesy films because I don't need to think"
    }
  },
  {
    "text": {
      "ru": "Я думал, что буду бояться лететь на самолете, но весь полет до Англии я был спокоен",
      "en": "I thought I was afraid of flying, but I was cool as a cucumber all the way to England"
    }
  },
  {
    "text": {
      "ru": "Вчера Джим купил DVD с лучшими фильмами этого сезона",
      "en": "Yesterday Jim bought DVD with the cream of the crop of this season's movies"
    }
  },
  {
    "text": {
      "ru": "После сна я снова был полон энергии",
      "en": "After the sleep, I was again full of beans"
    }
  },
  {
    "text": {
      "ru": "Люси без ума от кошек",
      "en": "Lucy is nuts about cats"
    }
  },
  {
    "text": {
      "ru": "В этот раз я не собираюсь тебе помогать. Тебе придется пошевелить мозгами",
      "en": "This time I won't help you with the task. You'll have to use your noodle"
    }
  }
]
